---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.IntermediateLandingHigherThanTopRunFailure
source: html/734e1317-1ba7-99bd-1999-64f6a33d966b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.IntermediateLandingHigherThanTopRunFailure Property

Run is reversed.

## Syntax (C#)
```csharp
public static FailureDefinitionId IntermediateLandingHigherThanTopRunFailure { get; }
```